src/Embedded System/DM816x/DM816x Overview.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: DM816x Overview
#+OPTIONS: num:nil H:2


* Product site
http://www.ti.com/product/tms320dm8168

* Overview
http://processors.wiki.ti.com/index.php/DM816x_C6A816x_AM389x_Overview

* configuration about the target
It is the number of coprocessors in the configuration. The TI816x has
several subsystems but no hardware accelerators. The TI816x(no STM,
ETB only) is the same as TI816x but does not have the System Trace
module (so it is compatible with emulators other than XDS560v2). The
TI816x_HWA is the most complete setup (however it uses more memory and
takes the longest time during debugging).

* spectrum digital
 http://support.spectrumdigital.com/boards/evm816x/revg/

* Debug
** Connecting to DSP on C6A8168, DM8168, DM8148
http://processors.wiki.ti.com/index.php/Connecting_to_DSP_on_C6A8168,_DM8168,_DM8148
** C6A816x, AM389x, DM816x, DM814x Debug and Trace Tools
http://processors.wiki.ti.com/index.php/C6A816x,_AM389x,_DM816x,_DM814x_Debug_and_Trace_Tools
** Linux Debug in CCSv5
http://processors.wiki.ti.com/index.php/Linux_Debug_in_CCSv5

* DM816x C6A816x AM389x DDR3 Init
http://processors.wiki.ti.com/index.php/DM816x_C6A816x_AM389x_DDR3_Init
* index
http://processors.wiki.ti.com/index.php/Category:DM816x

* DaVinci Memorymaps
http://processors.wiki.ti.com/index.php/Category:DaVinci_Memorymaps

* Debugging
http://processors.wiki.ti.com/index.php/Category:DaVinci_Debugging

** Debugging on DaVinci using kgdb
http://processors.wiki.ti.com/index.php/Debugging_on_DaVinci_using_kgdb
** Debugging remotely on DaVinci using gdb
http://processors.wiki.ti.com/index.php/Debugging_remotely_on_DaVinci_using_gdb
* TI Android GingerBread 2.3.4 DevKit
http://processors.wiki.ti.com/index.php/TI-Android-GingerBread-2.3.4-DevKit-2.1.2_ReleaseNotes

* DaVinci GIT Linux Kernel
http://processors.wiki.ti.com/index.php/DaVinci_GIT_Linux_Kernel
* Category:DaVinci Linux
http://processors.wiki.ti.com/index.php/Category:DaVinci_Linux

z
* Connecting to DSP on C6A8168, DM8168, DM8148
http://processors.wiki.ti.com/index.php/Connecting_to_DSP_on_C6A8168,_DM8168,_DM8148
 
