public_html/Embedded System/DM816x/DM816x Overview.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DM816x Overview</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="DM816x Overview"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-19 16:25:23 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">DM816x Overview</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Product site</a></li>
<li><a href="#sec-2">Overview</a></li>
<li><a href="#sec-3">configuration about the target</a></li>
<li><a href="#sec-4">spectrum digital</a></li>
<li><a href="#sec-5">Debug</a>
<ul>
<li><a href="#sec-5-1">Connecting to DSP on C6A8168, DM8168, DM8148</a></li>
<li><a href="#sec-5-2">C6A816x, AM389x, DM816x, DM814x Debug and Trace Tools</a></li>
<li><a href="#sec-5-3">Linux Debug in CCSv5</a></li>
</ul>
</li>
<li><a href="#sec-6">DM816x C6A816x AM389x DDR3 Init</a></li>
<li><a href="#sec-7">index</a></li>
<li><a href="#sec-8">DaVinci Memorymaps</a></li>
<li><a href="#sec-9">Debugging</a>
<ul>
<li><a href="#sec-9-1">Debugging on DaVinci using kgdb</a></li>
<li><a href="#sec-9-2">Debugging remotely on DaVinci using gdb</a></li>
</ul>
</li>
<li><a href="#sec-10">TI Android GingerBread 2.3.4 DevKit</a></li>
<li><a href="#sec-11">DaVinci GIT Linux Kernel</a></li>
<li><a href="#sec-12">Category:DaVinci Linux</a></li>
<li><a href="#sec-13">Connecting to DSP on C6A8168, DM8168, DM8148</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Product site</h2>
<div class="outline-text-2" id="text-1">

<p><a href="http://www.ti.com/product/tms320dm8168">http://www.ti.com/product/tms320dm8168</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Overview</h2>
<div class="outline-text-2" id="text-2">

<p><a href="http://processors.wiki.ti.com/index.php/DM816x_C6A816x_AM389x_Overview">http://processors.wiki.ti.com/index.php/DM816x_C6A816x_AM389x_Overview</a>
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">configuration about the target</h2>
<div class="outline-text-2" id="text-3">

<p>It is the number of coprocessors in the configuration. The TI816x has
several subsystems but no hardware accelerators. The TI816x(no STM,
ETB only) is the same as TI816x but does not have the System Trace
module (so it is compatible with emulators other than XDS560v2). The
TI816x<sub>HWA</sub> is the most complete setup (however it uses more memory and
takes the longest time during debugging).
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">spectrum digital</h2>
<div class="outline-text-2" id="text-4">

<p> <a href="http://support.spectrumdigital.com/boards/evm816x/revg/">http://support.spectrumdigital.com/boards/evm816x/revg/</a>
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Debug</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Connecting to DSP on C6A8168, DM8168, DM8148</h3>
<div class="outline-text-3" id="text-5-1">

<p><a href="http://processors.wiki.ti.com/index.php/Connecting_to_DSP_on_C6A8168,_DM8168,_DM8148">http://processors.wiki.ti.com/index.php/Connecting_to_DSP_on_C6A8168,_DM8168,_DM8148</a>
</p></div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">C6A816x, AM389x, DM816x, DM814x Debug and Trace Tools</h3>
<div class="outline-text-3" id="text-5-2">

<p><a href="http://processors.wiki.ti.com/index.php/C6A816x,_AM389x,_DM816x,_DM814x_Debug_and_Trace_Tools">http://processors.wiki.ti.com/index.php/C6A816x,_AM389x,_DM816x,_DM814x_Debug_and_Trace_Tools</a>
</p></div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">Linux Debug in CCSv5</h3>
<div class="outline-text-3" id="text-5-3">

<p><a href="http://processors.wiki.ti.com/index.php/Linux_Debug_in_CCSv5">http://processors.wiki.ti.com/index.php/Linux_Debug_in_CCSv5</a>
</p>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">DM816x C6A816x AM389x DDR3 Init</h2>
<div class="outline-text-2" id="text-6">

<p><a href="http://processors.wiki.ti.com/index.php/DM816x_C6A816x_AM389x_DDR3_Init">http://processors.wiki.ti.com/index.php/DM816x_C6A816x_AM389x_DDR3_Init</a>
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">index</h2>
<div class="outline-text-2" id="text-7">

<p><a href="http://processors.wiki.ti.com/index.php/Category:DM816x">http://processors.wiki.ti.com/index.php/Category:DM816x</a>
</p>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">DaVinci Memorymaps</h2>
<div class="outline-text-2" id="text-8">

<p><a href="http://processors.wiki.ti.com/index.php/Category:DaVinci_Memorymaps">http://processors.wiki.ti.com/index.php/Category:DaVinci_Memorymaps</a>
</p>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Debugging</h2>
<div class="outline-text-2" id="text-9">

<p><a href="http://processors.wiki.ti.com/index.php/Category:DaVinci_Debugging">http://processors.wiki.ti.com/index.php/Category:DaVinci_Debugging</a>
</p>

</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">Debugging on DaVinci using kgdb</h3>
<div class="outline-text-3" id="text-9-1">

<p><a href="http://processors.wiki.ti.com/index.php/Debugging_on_DaVinci_using_kgdb">http://processors.wiki.ti.com/index.php/Debugging_on_DaVinci_using_kgdb</a>
</p></div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2">Debugging remotely on DaVinci using gdb</h3>
<div class="outline-text-3" id="text-9-2">

<p><a href="http://processors.wiki.ti.com/index.php/Debugging_remotely_on_DaVinci_using_gdb">http://processors.wiki.ti.com/index.php/Debugging_remotely_on_DaVinci_using_gdb</a>
</p></div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">TI Android GingerBread 2.3.4 DevKit</h2>
<div class="outline-text-2" id="text-10">

<p><a href="http://processors.wiki.ti.com/index.php/TI-Android-GingerBread-2.3.4-DevKit-2.1.2_ReleaseNotes">http://processors.wiki.ti.com/index.php/TI-Android-GingerBread-2.3.4-DevKit-2.1.2_ReleaseNotes</a>
</p>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">DaVinci GIT Linux Kernel</h2>
<div class="outline-text-2" id="text-11">

<p><a href="http://processors.wiki.ti.com/index.php/DaVinci_GIT_Linux_Kernel">http://processors.wiki.ti.com/index.php/DaVinci_GIT_Linux_Kernel</a>
</p></div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">Category:DaVinci Linux</h2>
<div class="outline-text-2" id="text-12">

<p><a href="http://processors.wiki.ti.com/index.php/Category:DaVinci_Linux">http://processors.wiki.ti.com/index.php/Category:DaVinci_Linux</a>
</p>
<p>
z
</p></div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">Connecting to DSP on C6A8168, DM8168, DM8148</h2>
<div class="outline-text-2" id="text-13">

<p><a href="http://processors.wiki.ti.com/index.php/Connecting_to_DSP_on_C6A8168,_DM8168,_DM8148">http://processors.wiki.ti.com/index.php/Connecting_to_DSP_on_C6A8168,_DM8168,_DM8148</a>
</p>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-19 16:25:23 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
